<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>
    <form action="" method="POST">
        <input type="date" name="date">
        <Button>click</Button>
    </form>

    <?php
    $indata = $_POST['date'];
        
    $indate = strtotiMe($indata);
    $iM = idate('m',$indate);
    $iD = idate('d',$indate);

    
    $signs = getinfo($iM,$iD);
    function getinfo($iM,$iD){
    
    if(($iM == 3  && $iD >= 21) || ($iM == 4  && $iD <= 20)){
        return "Овен";
    }
    else if(($iM == 4 && $iD >= 21) || ($iM == 5  && $iD <= 20)){
        return "Телец";
    }
    else if(($iM == 5 && $iD >= 22) || ($iM == 6 && $iD <= 21)){
        return "Близнецы";
    }
    else if(($iM == 6 && $iD >= 22) || ($iM == 7 && $iD <= 21)){
        return "Рак";
    }
    else if(($iM == 7 && $iD >= 23) || ($iM == 8 && $iD <= 23)){
        return "Лев";
    }
    else if(($iM == 8 && $iD >= 24) || ($iM == 9 && $iD <= 22)){
        return "Дева";
    }
    else if(($iM == 9 && $iD >= 23) || ($iM == 10 && $iD <= 22)){
        return "Весы";
    }
    else if(($iM == 10 && $iD >= 23) || ($iM == 11 && $iD <= 22)){
        return "Скорпион";
    }
    else if(($iM == 11 && $iD >= 22) || ($iM == 12 && $iD <= 21)){
        return "Стрелец";
    }
    else if(($iM == 12 && $iD >= 22) || ($iM == 1 && $iD <= 20)){
        return "Козерог";
    }
    else if(($iM == 1 && $iD >= 21) || ($iM == 2 && $iD <= 19)){
        return "Водолей";
    }
    else if(($iM == 2 && $iD >= 200) || ($iM == 3 && $iD <= 20)){
        return "Рыбы";
    }
    else{
        return "Error";
    }
    }
    
    $future = [
        "17.02.2023" => [
        "Овен" => "Вас ждет неудача",
        "Телец" => "Вас ждет удача",
        "Близнецы" => "Вас ждет злость",
        "Рак" => "Вас ждет грусть",
        "Лев" => "Вас ждет счастье",
        "Дева" => "Вас ждет надежда",
        "Весы" => "Вас ждет любовь",
        "Скорпион" => "Вас ждет грусть",
        "Стрелец" => "Вас ждет гармония",
        "Козерог" => "Вас ждет муза",
        "Водолей" => "Вас ждут новые открытия",
        "Рыбы" => "Вас ждут новые знакомства",
    ],
        "18.02.2023" => [
        "Овен" => "Вас ждет грусть",
        "Телец" => "Вас ждет радость",
        "Близнецы" => "Вас ждет счастье",
        "Рак" => "Вас ждет удача",
        "Лев" => "Вас ждет неудача",
        "Дева" => "Вас ждет удовлетворение",
        "Весы" => "Вас ждут новые знания",
        "Скорпион" => "Вас ждут новые навыки",
        "Стрелец" => "Вас ждет спортзал",
        "Козерог" => "Вас ждет обогащение",
        "Водолей" => "Вас ждет трата денег",
        "Рыбы" => "Вас ждет удача",
    ],
        "19.02.2023" => [
        "Овен" => "Вас ждет неудача",
        "Телец" => "Вас ждет удача",
        "Близнецы" => "Вас ждет злость",
        "Рак" => "Вас ждет грусть",
        "Лев" => "Вас ждет опустошение",
        "Дева" => "Вас ждет надежда",
        "Весы" => "Вас ждет любовь",
        "Скорпион" => "Вас ждет грусть",
        "Стрелец" => "Вас ждет гармония",
        "Козерог" => "Вас ждет муза",
        "Водолей" => "Вас ждут новые открытия",
        "Рыбы" => "Вас ждут новые знакомства",
    ]
        ];
    $nowDate = date('d.m.Y');
    echo "Ваш знак - ".$signs." ".$future[$nowDate][$signs];
    ?>

</body>
</html>